backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 200
      - 1024
      - 200
      - 1
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 7
      - 7
      - 7
      name: conv3d
      padding: same
      strides: !!python/tuple
      - 2
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv3d
  - class_name: MaxPooling3D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling3d
      padding: same
      pool_size: !!python/tuple
      - 3
      - 3
      - 3
      strides: !!python/tuple
      - 2
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - conv3d
        - 0
        - 0
        - {}
    name: max_pooling3d
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1
      scale: true
      trainable: true
    inbound_nodes:
    - - - max_pooling3d
        - 0
        - 0
        - training: true
    name: batch_normalization_v1
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1
        - 0
        - 0
        - {}
    name: activation
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: &id002 !!python/tuple
      - 1
      - 1
      - 1
      name: conv3d_1
      padding: same
      strides: &id003 !!python/tuple
      - 1
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_1
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_3
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_5
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_5
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_7
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_7
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_9
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_9
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_11
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_11
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_13
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_13
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_15
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: conv3d_15
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_1
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_1
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_3
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_3
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_5
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_5
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_7
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_7
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_9
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_9
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_11
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_11
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_13
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_13
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_15
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_15
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_15
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_1
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_3
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_3
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_5
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_5
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_7
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_7
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_9
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_9
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_11
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_11
        - 0
        - 0
        - {}
    name: activation_11
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_13
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_13
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_15
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_15
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: &id004 !!python/tuple
      - 3
      - 3
      - 3
      name: conv3d_2
      padding: same
      strides: &id005 !!python/tuple
      - 1
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: conv3d_2
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: conv3d_4
      padding: same
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: conv3d_4
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: conv3d_6
      padding: same
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: conv3d_6
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: conv3d_8
      padding: same
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: conv3d_8
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: conv3d_10
      padding: same
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: conv3d_10
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: conv3d_12
      padding: same
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_11
        - 0
        - 0
        - {}
    name: conv3d_12
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: conv3d_14
      padding: same
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_13
        - 0
        - 0
        - {}
    name: conv3d_14
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id004
      name: conv3d_16
      padding: same
      strides: *id005
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_15
        - 0
        - 0
        - {}
    name: conv3d_16
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_2
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_2
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_4
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_4
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_6
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_6
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_8
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_8
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_10
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_10
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_12
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_12
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_14
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_14
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_14
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_16
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_16
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_16
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_2
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_4
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_4
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_6
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_6
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_8
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_8
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_10
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_10
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_12
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_12
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_14
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_14
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_16
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_16
        - 0
        - 0
        - {}
    name: activation_16
  - class_name: Concatenate
    config:
      axis: -1
      dtype: float32
      name: concatenate
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - &id006 {}
      - - activation_4
        - 0
        - 0
        - *id006
      - - activation_6
        - 0
        - 0
        - *id006
      - - activation_8
        - 0
        - 0
        - *id006
      - - activation_10
        - 0
        - 0
        - *id006
      - - activation_12
        - 0
        - 0
        - *id006
      - - activation_14
        - 0
        - 0
        - *id006
      - - activation_16
        - 0
        - 0
        - *id006
    name: concatenate
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: &id010 !!python/tuple
      - 1
      - 1
      - 1
      name: conv3d_17
      padding: same
      strides: &id011 !!python/tuple
      - 1
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate
        - 0
        - 0
        - {}
    name: conv3d_17
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_17
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_17
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_17
  - class_name: GlobalAveragePooling3D
    config:
      data_format: channels_last
      dtype: float32
      name: global_average_pooling3d
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_17
        - 0
        - 0
        - {}
    name: global_average_pooling3d
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 8
      use_bias: true
    inbound_nodes:
    - - - global_average_pooling3d
        - 0
        - 0
        - {}
    name: dense
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_17
      trainable: true
    inbound_nodes:
    - - - dense
        - 0
        - 0
        - {}
    name: activation_17
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 32
      use_bias: true
    inbound_nodes:
    - - - activation_17
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Activation
    config:
      activation: sigmoid
      dtype: float32
      name: activation_18
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: activation_18
  - class_name: Reshape
    config:
      dtype: float32
      name: reshape
      target_shape: !!python/tuple
      - 1
      - 1
      - 1
      - 32
      trainable: true
    inbound_nodes:
    - - - activation_18
        - 0
        - 0
        - {}
    name: reshape
  - class_name: Multiply
    config:
      dtype: float32
      name: multiply
      trainable: true
    inbound_nodes:
    - - - batch_normalization_v1_17
        - 0
        - 0
        - &id007 {}
      - - reshape
        - 0
        - 0
        - *id007
    name: multiply
  - class_name: Add
    config:
      dtype: float32
      name: add
      trainable: true
    inbound_nodes:
    - - - multiply
        - 0
        - 0
        - &id008 {}
      - - activation
        - 0
        - 0
        - *id008
    name: add
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_19
      trainable: true
    inbound_nodes:
    - - - add
        - 0
        - 0
        - {}
    name: activation_19
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_18
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_18
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_20
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_20
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_22
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_22
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_24
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_24
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_26
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_26
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_28
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_28
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_30
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_30
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      kernel_size: *id002
      name: conv3d_32
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: conv3d_32
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_18
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_18
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_18
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_20
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_20
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_20
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_22
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_22
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_22
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_24
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_24
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_24
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_26
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_26
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_26
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_28
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_28
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_28
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization_v1_30
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv3d_30
        - 0
        - 0
        - training: true
    name: batch_normalization_v1_30
  - class_name: BatchNormalizationV1
    config:
      axis:
      - 4
      beta_constraint: null
      beta_initializer:
